In [5]:
import pandas as pd
import numpy as np
import glob
import matplotlib.pyplot as plt

txt_files = glob.glob('./Names/*.txt')

# x = txt_files[1]
year = []
li = []
for i in txt_files:
    current_year = int(i[-8:-4])
    year.append(current_year)
    df = pd.read_csv(i, sep=',', header=None, names=['Name', 'Sex', 'Num'])
    df["Year"] = current_year
    li.append(df)
data = pd.concat(li, ignore_index=True)
# x = data.groupby(['Sex', 'Year']).sum().reset_index()
# y = x.pivot(index='Year', columns='Sex')
# z = y.plot(figsize=(12, 6), grid=True)
# z = y.plot(figsize=(12, 6), grid=True)
# z
#plt.show()
n = data.groupby(['Year','Sex']).apply(lambda x: x.nlargest(1000, "Num")[['Name', 'Num']])
# data_1000 = data.nlargest(1000, "Num").reset_index()
# d1 = data_1000.pivot(index ='Year', columns='Name')
# data_1000
n.head()
# print("asdsdsd")

                 Name   Num
Year Sex
1880 F   0       Mary  7065
         1       Anna  2604
         2       Emma  2003
         3  Elizabeth  1939
         4     Minnie  1746